nordic-auko/nRF5-ble-timesync-demo/ncs/timesync_sample/src/timesync/time_sync_nrf53.c
/*
 * Copyright (c) 2022 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include "time_sync.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>

#include <nrfx.h>
#include <nrfx_dppi.h>

#include <hal/nrf_egu.h>
#include <hal/nrf_power.h>
#include <hal/nrf_dppi.h>
#include <hal/nrf_radio.h>
#include <hal/nrf_timer.h>

#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/nrf_clock_control.h>

#include <mpsl_timeslot.h>
#include <mpsl.h>

#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/ring_buffer.h>

#define LOG_MODULE_NAME timesync
LOG_MODULE_REGISTER(LOG_MODULE_NAME);

#if   defined ( __CC_ARM )
#define TX_CHAIN_DELAY (699 - 235)
#elif defined ( __ICCARM__ )
#define TX_CHAIN_DELAY (703 - 235)
#elif defined ( __GNUC__ )
#define TX_CHAIN_DELAY (704 - 173)
#endif

#if TIME_SYNC_TIMER_MAX_VAL < 10000
#error Timer values below 10000 not supported
#endif

#define TIME_SYNC_DESYNC_CHECK_INTERVAL 1000

#define SYNC_PKT_QUEUE_LEN 3

#define TS_LEN_US                            (1000UL)
#define TX_LEN_EXTENSION_US                  (1000UL)
#define TS_SAFETY_MARGIN_US                  (200UL)   /**< The timeslot activity should be finished with this much to spare. */
#define TS_EXTEND_MARGIN_US                  (400UL)   /**< The timeslot activity should request an extension this long before end of timeslot. */

#if defined(CONFIG_SOC_SERIES_NRF53X)
#define TS_SWI_IRQn NRFX_CONCAT_3(SWI, CONFIG_TIMESYNC_SWI, _IRQn)
#define TS_EGU_IRQn NRFX_CONCAT_3(EGU, CONFIG_TIMESYNC_EGU, _IRQn)
#elif defined(CONFIG_SOC_SERIES_NRF52X)
#define TS_SWI_IRQn NRFX_CONCAT_3(SWI, CONFIG_TIMESYNC_SWI, NRFX_CONCAT_3(_EGU, CONFIG_TIMESYNC_SWI, _IRQn))
#define TS_EGU_IRQn NRFX_CONCAT_3(SWI, CONFIG_TIMESYNC_EGU, NRFX_CONCAT_3(_EGU, CONFIG_TIMESYNC_EGU, _IRQn))
#if CONFIG_TIMESYNC_SWI == CONFIG_TIMESYNC_EGU
#error Cannot use the same instance of EGU and SWI
#endif /* CONFIG_TIMESYNC_SWI == CONFIG_TIMESYNC_EGU */
#endif /* defined(CONFIG_SOC_SERIES_NRF53X) */

#define FREEWHEEL_TIMER_IRQn NRFX_CONCAT_3(TIMER, CONFIG_TIMESYNC_FREEWHEEL_TIMER, _IRQn)
#define COUNTER_TIMER_IRQn NRFX_CONCAT_3(TIMER, CONFIG_TIMESYNC_COUNTER_TIMER, _IRQn)

#define FREEWHEEL_TIMER NRFX_CONCAT_2(NRF_TIMER, CONFIG_TIMESYNC_FREEWHEEL_TIMER)
#define COUNTER_TIMER NRFX_CONCAT_2(NRF_TIMER, CONFIG_TIMESYNC_COUNTER_TIMER)
#define EGU_INST NRFX_CONCAT_2(NRF_EGU, CONFIG_TIMESYNC_EGU)

enum dppi_channels {
	DPPI_CHN_COUNTER_COUNT,   /* Increment counter */
	DPPI_CHN_CAPTURE_RADIO,   /* Capture timer values upon radio events */
	DPPI_CHN_CAPTURE_MANUAL,  /* Capture timer values upon manual request (ts_timestamp_get_ticks) */
	DPPI_CHN_COUNT,
};

static void dppi_counter_configure(void);
static void dppi_radio_disable(void);
static void dppi_radio_rx_configure(void);
static void dppi_radio_tx_configure(void);
static void dppi_counter_timer_capture_configure(void);
static void dppi_sync_trigger_configure(uint8_t dppi_channel);
static void dppi_counter_timer_triggered_capture_configure(uint8_t dppi_channel);

struct {
	uint8_t rf_chn;
	uint8_t rf_addr[5];
} m_params;

static uint8_t m_dppi_channels[DPPI_CHN_COUNT];

#if CONFIG_TIMESYNC_FREEWHEEL_TIMER == CONFIG_TIMESYNC_COUNTER_TIMER
#error Freewheel timer and counter cannot be the same
#endif

__packed struct sync_pkt {
	int32_t  timer_val;
	int32_t  rtc_val;
	uint32_t counter_val;
};

BUILD_ASSERT(sizeof(struct sync_pkt) == 12);

static atomic_t m_timeslot_session_open;
static atomic_t m_pending_close;
static atomic_t m_pending_tx_stop;
static atomic_t m_blocked_cancelled_count;
static atomic_t m_desync_counter;
static uint32_t m_total_timeslot_length = 0;
static uint32_t m_timeslot_distance = 0;
static uint32_t m_tx_slot_retry_count = 0;

static atomic_t m_send_sync_pkt = false;
static atomic_t m_timer_update_in_progress = false;

static bool m_synchronized = false;

static atomic_t m_master_counter_diff = 0;
static atomic_t m_rcv_count = 0;

static atomic_t mp_curr_adj_pkt;
static atomic_t m_curr_adj_timer;
static atomic_t m_curr_adj_counter;

static ts_evt_handler_t m_callback;
static atomic_t m_tick_target;
static atomic_t m_sync_packet_count = 0;
static atomic_t m_used_packet_count = 0;
static atomic_t m_last_sync = 0;
static atomic_t m_prev_sync_pkt_timer;
static atomic_t m_prev_sync_pkt_counter;

static struct onoff_manager *clk_mgr;
static struct onoff_client clk_cli;

/* Simple circular buffer: no free, only take */
static struct sync_pkt m_sync_pkt_ringbuf[10] __ALIGN(sizeof(uint32_t));
static atomic_t m_sync_pkt_ringbuf_idx;

static volatile enum
{
	RADIO_STATE_IDLE, /* Default state */
	RADIO_STATE_RX,   /* Waiting for packets */
	RADIO_STATE_TX    /* Trying to transmit packet */
} m_radio_state = RADIO_STATE_IDLE;

/**< This will be used when requesting the first timeslot or any time a timeslot is blocked or cancelled. */
static mpsl_timeslot_request_t m_timeslot_req_earliest = {
		.request_type = MPSL_TIMESLOT_REQ_TYPE_EARLIEST,
		.params.earliest.hfclk = MPSL_TIMESLOT_HFCLK_CFG_XTAL_GUARANTEED,
		.params.earliest.priority = MPSL_TIMESLOT_PRIORITY_NORMAL,
		.params.earliest.length_us = TS_LEN_US,
		.params.earliest.timeout_us = 100000 /* Expect timeslot within 100 ms */
};

/**< This will be used at the end of each timeslot to request the next timeslot. */
static mpsl_timeslot_request_t m_timeslot_req_normal = {
	.request_type = MPSL_TIMESLOT_REQ_TYPE_NORMAL,
	.params.normal.hfclk = MPSL_TIMESLOT_HFCLK_CFG_XTAL_GUARANTEED,
	.params.normal.priority = MPSL_TIMESLOT_PRIORITY_NORMAL,
	.params.normal.distance_us = 0,
	.params.normal.length_us = TS_LEN_US,
};

static mpsl_timeslot_signal_return_param_t signal_callback_return_param;
static mpsl_timeslot_session_id_t session_id;

/* Ring buffer for handling low priority signals outside of timeslot callback */
RING_BUF_DECLARE(callback_low_priority_ring_buf, 10);

static void timeslot_begin_handler(void);
static void timeslot_end_handler(void);
static void timeslot_radio_handler(void);
static bool sync_timer_offset_compensate(struct sync_pkt * p_pkt);
static struct sync_pkt * tx_buf_get(void);

// static void increment_desync_timeout(uint32_t increment_usec);

ISR_DIRECT_DECLARE(swi_isr)
{
	static const char *signal_type_str[] = {
		"MPSL_TIMESLOT_SIGNAL_START",
		"MPSL_TIMESLOT_SIGNAL_TIMER0",
		"MPSL_TIMESLOT_SIGNAL_RADIO",
		"MPSL_TIMESLOT_SIGNAL_EXTEND_FAILED",
		"MPSL_TIMESLOT_SIGNAL_EXTEND_SUCCEEDED",
		"MPSL_TIMESLOT_SIGNAL_BLOCKED",
		"MPSL_TIMESLOT_SIGNAL_CANCELLED",
		"MPSL_TIMESLOT_SIGNAL_SESSION_IDLE",
		"MPSL_TIMESLOT_SIGNAL_INVALID_RETURN",
		"MPSL_TIMESLOT_SIGNAL_SESSION_CLOSED",
		"MPSL_TIMESLOT_SIGNAL_OVERSTAYED",
	};
	uint8_t signal_type = 0;

	while (!ring_buf_is_empty(&callback_low_priority_ring_buf)) {
		if (ring_buf_get(&callback_low_priority_ring_buf, &signal_type, 1) == 1) {
			int err;

			__ASSERT_NO_MSG(signal_type < ARRAY_SIZE(signal_type_str));

			LOG_INF("Signal: %s", signal_type_str[signal_type]);

