nordic-auko/nRF5-ble-timesync-demo/ncs/timesync_sample/src/timesync/time_sync_nrf53.c
			p_pkt = tx_buf_get();

			nrf_radio_packetptr_set(NRF_RADIO, p_pkt);

			// m_usec_since_sync_packet = 0;
			atomic_clear(&m_desync_counter);
		}

		atomic_add(&m_rcv_count, 1);
	}

resume_radio_rx:

	nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_START);
}

static void timestamp_counter_start(void)
{
	// COUNTER_TIMER is used in counter mode to count the number of sync timer overflows/resets
	// When timestamp API is used, the number of overflows/resets + current value of sync timer must be added up to give accurate timestamp information
	nrf_timer_task_trigger(COUNTER_TIMER, NRF_TIMER_TASK_STOP);
	nrf_timer_task_trigger(COUNTER_TIMER, NRF_TIMER_TASK_CLEAR);
	nrf_timer_prescaler_set(COUNTER_TIMER, NRF_TIMER_FREQ_16MHz);
	nrf_timer_mode_set(COUNTER_TIMER, NRF_TIMER_MODE_COUNTER);
	nrf_timer_bit_width_set(COUNTER_TIMER, NRF_TIMER_BIT_WIDTH_32);
	nrf_timer_cc_set(COUNTER_TIMER,
		NRF_TIMER_CC_CHANNEL3, TIME_SYNC_MSEC_TO_TICK(TIME_SYNC_DESYNC_CHECK_INTERVAL));
	nrf_timer_int_enable(COUNTER_TIMER, NRF_TIMER_INT_COMPARE3_MASK);
	nrf_timer_task_trigger(COUNTER_TIMER, NRF_TIMER_TASK_START);
}

static void freewheel_timer_start(void)
{
	// FREEWHEEL_TIMER (NRF_TIMER) is the always-running sync timer
	// The timing master never adjusts this timer
	// The timing slave(s) adjusts this timer whenever a sync packet is received and the logic determines that there is
	// Uses one-shot compare channels to make adjustments to timer cycle
	nrf_timer_task_trigger(FREEWHEEL_TIMER, NRF_TIMER_TASK_STOP);
	nrf_timer_task_trigger(FREEWHEEL_TIMER, NRF_TIMER_TASK_CLEAR);
	nrf_timer_prescaler_set(FREEWHEEL_TIMER, NRF_TIMER_FREQ_16MHz);
	nrf_timer_mode_set(FREEWHEEL_TIMER, NRF_TIMER_MODE_TIMER);
	nrf_timer_bit_width_set(FREEWHEEL_TIMER, NRF_TIMER_BIT_WIDTH_32);
	nrf_timer_shorts_set(FREEWHEEL_TIMER,
		NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK |
		NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK |
		NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK);
	nrf_timer_one_shot_enable(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL1);
	nrf_timer_one_shot_enable(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL2);
	nrf_timer_int_enable(FREEWHEEL_TIMER,
		NRF_TIMER_INT_COMPARE1_MASK | NRF_TIMER_INT_COMPARE2_MASK);
	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL0, TIME_SYNC_TIMER_MAX_VAL);
	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL1, 0xFFFFFFFF);
	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL2, 0xFFFFFFFF);
	nrf_timer_cc_set(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL3, 0xFFFFFFFF);
	nrf_timer_task_trigger(FREEWHEEL_TIMER, NRF_TIMER_TASK_START);
}

int ts_set_trigger(uint32_t target_tick, uint8_t dppi_channel)
{
	if (!m_timeslot_session_open)
	{
		return -EBUSY;
	}

	dppi_sync_trigger_configure(dppi_channel);

	atomic_set(&m_sync_packet_count, 0);
	atomic_set(&m_used_packet_count, 0);

	// TODO: is there a way to check if the target value is plausible?

	nrf_timer_cc_set(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL4, (target_tick - atomic_get(&m_master_counter_diff)));
	atomic_set(&m_tick_target, target_tick);

	return 0;
}

int ts_set_timestamp_trigger(uint8_t dppi_channel)
{
	dppi_counter_timer_triggered_capture_configure(dppi_channel);

	return 0;
}

static inline bool sync_timer_offset_compensate(struct sync_pkt * p_pkt)
{
	uint32_t peer_timer;
	uint32_t local_timer;
	int32_t timer_offset;
	bool wrapped = false;

	if (atomic_set(&m_timer_update_in_progress, true))
	{
		return false;
	}

	peer_timer  = p_pkt->timer_val;
	peer_timer += TX_CHAIN_DELAY;
	if (peer_timer >= TIME_SYNC_TIMER_MAX_VAL)
	{
		peer_timer -= TIME_SYNC_TIMER_MAX_VAL;
		p_pkt->counter_val += 1;
		wrapped = true;
	}

	local_timer = nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL7);
	timer_offset = local_timer - peer_timer;

	if (local_timer > TIME_SYNC_TIMER_MAX_VAL)
	{
		// Todo: Investigate if this is a corner case with a root cause that needs to be handled
		atomic_clear(&m_timer_update_in_progress);
		return false;
	}

	if (timer_offset == TIME_SYNC_TIMER_MAX_VAL || timer_offset == 0)
	{
		// Already in sync
		atomic_add(&m_used_packet_count, 1);
		atomic_clear(&m_timer_update_in_progress);
		return false;
	}

	if (wrapped && (local_timer >= (TIME_SYNC_TIMER_MAX_VAL - 50)))
	{
		// Too close
		// Todo: see if local counter increment can be accounted for
		atomic_clear(&m_timer_update_in_progress);
		return false;
	}

	atomic_set(&mp_curr_adj_pkt, (uint32_t) p_pkt);

	atomic_set(&m_curr_adj_timer, nrf_timer_cc_get(FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL7));
	atomic_set(&m_curr_adj_counter, nrf_timer_cc_get(COUNTER_TIMER, NRF_TIMER_CC_CHANNEL7));

	bool shorten_cycle = timer_offset < 0;

	if (shorten_cycle) {
		/* Clear timer earlier than normal, and increment counter */
		nrf_timer_cc_set(
			FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL1, TIME_SYNC_TIMER_MAX_VAL + timer_offset);
	} else {
		/* Clear timer right after normal clear, but do not increment counter */
		nrf_timer_cc_set(
			FREEWHEEL_TIMER, NRF_TIMER_CC_CHANNEL2, timer_offset);
	}

	return true;
}

static void dppi_radio_rx_configure(void)
{
	// nrf_dppi_channels_disable(NRF_DPPIC_NS, BIT(m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]));

	nrf_radio_publish_clear(
		NRF_RADIO, NRF_RADIO_EVENT_READY);

	nrf_radio_publish_set(
		NRF_RADIO, NRF_RADIO_EVENT_ADDRESS, m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]);
	nrf_timer_subscribe_set(
		FREEWHEEL_TIMER, NRF_TIMER_TASK_CAPTURE7, m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]);
	nrf_timer_subscribe_set(
		COUNTER_TIMER, NRF_TIMER_TASK_CAPTURE7, m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]);

	nrf_dppi_channels_enable(NRF_DPPIC_NS, BIT(m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]));
}

static void dppi_radio_disable(void)
{
	nrf_dppi_channels_disable(NRF_DPPIC_NS, BIT(m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]));

	nrf_radio_publish_clear(
		NRF_RADIO, NRF_RADIO_EVENT_READY);
	nrf_radio_publish_clear(
		NRF_RADIO, NRF_RADIO_EVENT_ADDRESS);
}

static void dppi_radio_tx_configure(void)
{
	// nrf_dppi_channels_disable(NRF_DPPIC_NS, BIT(m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]));

	nrf_radio_publish_clear(
		NRF_RADIO, NRF_RADIO_EVENT_ADDRESS);

	nrf_radio_publish_set(
		NRF_RADIO, NRF_RADIO_EVENT_READY, m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]);
	nrf_timer_subscribe_set(
		FREEWHEEL_TIMER, NRF_TIMER_TASK_CAPTURE7, m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]);
	nrf_timer_subscribe_set(
		COUNTER_TIMER, NRF_TIMER_TASK_CAPTURE7, m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]);

	nrf_dppi_channels_enable(NRF_DPPIC_NS, BIT(m_dppi_channels[DPPI_CHN_CAPTURE_RADIO]));
}

